In [109]:
import pandas as pd
import numpy as np
import datetime
import warnings
import matplotlib.pyplot as plt
import seaborn as sns

In [110]:
df = pd.read_csv('../class1/learningSet.csv')

C:\Users\Dmitr\AppData\Local\Temp\ipykernel_18864\219825831.py:1: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('../class1/learningSet.csv')

In [111]:
nulls = pd.DataFrame(df.isna().sum()*100/len(df), columns=['percentage']) # Checking top 50 columns by null ammount in %
nulls.sort_values('percentage', ascending = False).head(50)

          percentage
RDATE_5    99.990567
RAMNT_5    99.990567
RDATE_3    99.746363
RAMNT_3    99.746363
RDATE_4    99.705488
RAMNT_4    99.705488
RAMNT_6    99.186685
RDATE_6    99.186685
RAMNT_15   92.388798
RDATE_15   92.388798
RDATE_23   91.763091
RAMNT_23   91.763091
RDATE_20   91.732696
RAMNT_20   91.732696
RAMNT_7    90.677273
RDATE_7    90.677273
RAMNT_17   90.146942
RDATE_17   90.146942
RDATE_21   90.029556
RAMNT_21   90.029556
RAMNT_10   89.035970
RDATE_10   89.035970
RDATE_13   87.160944
RAMNT_13   87.160944
NUMCHLD    87.018404
RDATE_11   84.551209
RAMNT_11   84.551209
RDATE_19   83.359535
RAMNT_19   83.359535
RAMNT_9    82.461326
RDATE_9    82.461326
RDATE_24   81.409047
RAMNT_24   81.409047
RAMNT_18   79.270951
RDATE_18   79.270951
RAMNT_22   78.123297
RDATE_22   78.123297
RAMNT_8    77.495493
RDATE_8    77.495493
RDATE_14   75.561774
RAMNT_14   75.561774
RAMNT_12   73.064185
RDATE_12   73.064185
RAMNT_16   71.707961
RDATE_16   71.707961
ADATE_15   68.625540
ADATE_23   58.975810
MBCOLECT   55.458433
MAGFAML    55.395548
MBCRAFT    55.395548

In [112]:
drop_list = [] # creating a list with columns ro remove

drop_list.append('OSOURCE')
drop_list.append('ZIP')

In [113]:
drop_list #current drop list

['OSOURCE', 'ZIP']

In [114]:
nulls_over_85 = list(nulls[nulls['percentage'] > 85].index) #creating a list with columns that have over 85% nulls
nulls_over_85

['NUMCHLD',
 'RDATE_3',
 'RDATE_4',
 'RDATE_5',
 'RDATE_6',
 'RDATE_7',
 'RDATE_10',
 'RDATE_13',
 'RDATE_15',
 'RDATE_17',
 'RDATE_20',
 'RDATE_21',
 'RDATE_23',
 'RAMNT_3',
 'RAMNT_4',
 'RAMNT_5',
 'RAMNT_6',
 'RAMNT_7',
 'RAMNT_10',
 'RAMNT_13',
 'RAMNT_15',
 'RAMNT_17',
 'RAMNT_20',
 'RAMNT_21',
 'RAMNT_23']

In [115]:
drop_list.extend(nulls_over_85) # extending current drop list with columns above

In [116]:
df1 = df.drop(columns=drop_list) # dropping columns from drop list and creating a new version (df1)

In [117]:
df1.shape

(95412, 454)

Below cleaning the "GENDER" column

In [118]:
print(df1['GENDER'].value_counts())
df1['GENDER'] = df1['GENDER'].fillna('F')

F    51277
M    39094
      2957
U     1715
J      365
C        2
A        2
Name: GENDER, dtype: int64

In [119]:
df1['GENDER'] = df1['GENDER'].apply(lambda x: "other" if x != "F" and x != "M" else x) 
# bucketing all genders to 'other' if not in F or M

In [120]:
df1['GENDER'].value_counts()

F        51277
M        39094
other     5041
Name: GENDER, dtype: int64

## lab2

In [121]:
df1_numerical = df1.select_dtypes('number')

In [122]:
df1_numerical.head()

,ODATEDW,TCODE,DOB,AGE,INCOME,WEALTH1,HIT,MBCRAFT,MBGARDEN,MBBOOKS,...,FISTDATE,NEXTDATE,TIMELAG,AVGGIFT,CONTROLN,TARGET_B,TARGET_D,HPHONE_D,RFA_2F,CLUSTER2
0,8901,0,3712,60.0,NaN,NaN,0,NaN,NaN,NaN,...,8911,9003.0,4.0,7.741935,95515,0,0.0,0,4,39.0
1,9401,1,5202,46.0,6.0,9.0,16,0.0,0.0,3.0,...,9310,9504.0,18.0,15.666667,148535,0,0.0,0,2,1.0
2,9001,1,0,NaN,3.0,1.0,2,0.0,0.0,1.0,...,9001,9101.0,12.0,7.481481,15078,0,0.0,1,4,60.0
3,8701,0,2801,70.0,1.0,4.0,2,0.0,0.0,0.0,...,8702,8711.0,9.0,6.812500,172556,0,0.0,1,4,41.0
4,8601,0,2001,78.0,3.0,2.0,60,1.0,0.0,9.0,...,7903,8005.0,14.0,6.864865,7112,0,0.0,1,2,26.0

In [123]:
df1_numerical.isna().sum().sort_values(ascending = False)

RDATE_11    80672
RAMNT_11    80672
RAMNT_19    79535
RDATE_19    79535
RAMNT_9     78678
            ...
RHP4            0
RHP3            0
RHP2            0
RHP1            0
PEC1            0
Length: 382, dtype: int64

In [124]:
pd.DataFrame(df1.isna().sum()*100/len(df), columns=['percentage']).sort_values('percentage', ascending = False).head(25)

          percentage
RAMNT_11   84.551209
RDATE_11   84.551209
RAMNT_19   83.359535
RDATE_19   83.359535
RDATE_9    82.461326
RAMNT_9    82.461326
RAMNT_24   81.409047
RDATE_24   81.409047
RAMNT_18   79.270951
RDATE_18   79.270951
RDATE_22   78.123297
RAMNT_22   78.123297
RAMNT_8    77.495493
RDATE_8    77.495493
RDATE_14   75.561774
RAMNT_14   75.561774
RAMNT_12   73.064185
RDATE_12   73.064185
RDATE_16   71.707961
RAMNT_16   71.707961
ADATE_15   68.625540
ADATE_23   58.975810
MBCOLECT   55.458433
PUBHLTH    55.395548
MAGFEM     55.395548

In [149]:
lab2_cols = ['GEOCODE2', 'WEALTH1', 'ADI', 'DMA', 'MSA']
lab2_cols_num = ['WEALTH1', 'ADI', 'DMA', 'MSA']

In [126]:
df1[lab2_cols].isna().sum() # checking NaN's

GEOCODE2      132
WEALTH1     44732
ADI           132
DMA           132
MSA           132
dtype: int64

In [127]:
df1[lab2_cols].describe()

            WEALTH1           ADI           DMA           MSA
count  50680.000000  95280.000000  95280.000000  95280.000000
mean       5.345699    187.356402    664.004072   3527.744102
std        2.742490    137.019184    116.363600   2863.904737
min        0.000000      0.000000      0.000000      0.000000
25%        3.000000     65.000000    561.000000    520.000000
50%        6.000000    175.000000    635.000000   3350.000000
75%        8.000000    279.000000    801.000000   5960.000000
max        9.000000    651.000000    881.000000   9360.000000

In [136]:
df2 = df1.copy() # copying the data frame

In [150]:
for col in lab2_cols_num: #filling the required columns with mean 
    mean = df2[col].mean()
    df2[col].fillna(mean, inplace=True)

In [137]:
df2['GEOCODE2'].value_counts() # checking the values in categorical column

A    34803
B    28505
D    16580
C    15524
Name: GEOCODE2, dtype: int64

In [138]:
df2['GEOCODE2'] = df2['GEOCODE2'].apply(lambda x: 'A' if pd.isna(x) else x) #filling nulls with mode

In [139]:
df2['GEOCODE2'].value_counts() # category with empty value is still present('')

A    34803
B    28505
D    16580
C    15524
Name: GEOCODE2, dtype: int64

In [153]:
df2['GEOCODE2'] = df2['GEOCODE2'].apply(lambda x: 'A' if x not in ['A','B','C','D'] else x) 
#filling empty category with mode too

In [143]:
df2['GEOCODE2'].value_counts()

A    34803
B    28505
D    16580
C    15524
Name: GEOCODE2, dtype: int64

In [152]:
df2[lab2_cols].isna().sum() #all the null values filled

GEOCODE2    0
WEALTH1     0
ADI         0
DMA         0
MSA         0
dtype: int64